{
    "projects": [
        {
            "title":"kukahomeusa.com",
            "url":"https://kukahomeusa.com/", 
            "imagepath":"Kuka.jpg", 
            "company":"Ansel & Anderson", 
            "role":"UI Developer and Designer", 
            "framework":"Wordpress", 
            "technologies":[
                "HTML", 
                "CSS", 
                "Site Editor PlugIn", 
                "SEO", 
                "ADA Compliancy", 
                "Asana"
            ], 
            "description":"As a current client's website, I am solely in charge of maintaining and monitoring functionality and usability of this website.", 
            "workexamples":[
                {
                    "title":"Becki Owens Collection Page", 
                    "description":"I completely redesigned and rebuilt this page to feature their new collaboration with the exclusive interior designer Becki Owens. This page was the first on the website to be solely optimized for an enjoyable experience on mobile and tablet as well as completely ADA compliant.", 
                    "projecturl":"https://kukahomeusa.com/discover-our-collections/becki-owens-home/"
                }, 
                {
                    "title":"Contact Us Page", 
                    "description":"By adding a new layout and custom code, I created a more inviting and informative contact us page.", 
                    "projecturl":"https://kukahomeusa.com/contact-us/"
                } 
            ]
        },
        {
            "title":"bluestockadvisors.com",
            "url":"https://bluestockadvisors.com/", 
            "imagepath":"Bluestock.jpg",
            "company":"Ansel & Anderson",
            "role":"UI Developer and Designer", 
            "framework":"Wix", 
            "technologies":[
                "SEO Optimization", 
                "Responsive Web Design", 
                "ADA Compliancy"
            ], 
            "description":"I joined the team right as we were about to launch this website. They hired me to optimize the user experience for monitor, tablet and mobile screens. Along with improving the web experience, I also was soley in charge of optimizing the site for SEO and ADA compliancy.",
            "workexamples":[
                {
                    "title":"Our Client Carousel", 
                    "description":"Our client asked for an infitity slider as a solution to list out their clients. I built out this autoplay carousel instead that loops infinitly through their clients.", 
                    "projecturl":"https://www.bluestockadvisors.com/"
                }, 
                {
                    "title":"Four Primary Service Areas Tab & Mini Nav", 
                    "description":"I noticed that the user was having to jump around to several pages to get to the next service areas page. I suggested and built a mini navigation so the user can now easily access all four service area pages.", 
                    "projecturl":"https://www.bluestockadvisors.com/growth-strategy"
                }, 
                {
                    "title":"Tab Layout and Design", 
                    "description":"I changed all of the settings on each of the tab elements to all have the exact same transition effects, colors, fonts, margin, padding and spacing throughout all of the different viewports.", 
                    "projecturl":"https://www.bluestockadvisors.com/approach"
                }
                
            ]
        },
        { 
            "title":"checksforfree.com",
            "url":"https://checksforfree.com/",
            "imagepath":"ChecksForFree.jpg",
            "company":"Main Street Inc.",
            "role":"Frontend Developer and UX Designer", 
            "framework":"Custom Build", 
            "technologies":[
                "React", 
                "Node.js", 
                "JSX", 
                "JavaScript",
                "TypeScript", 
                "CSS", 
                "C#", 
                ".NET", 
                "Docker", 
                "Visual Studio", 
                "MySQL", 
                "MySQL Server", 
                "FullStory", 
                "Google Analytics", 
                "Jira"
            ], 
            "description":"As a newly launched website when I started, I was in charge of monitoring user behavior and pin point user frustration. Then design an appropriate solution. I added a section where a user can select a woodcut and then the selected woodcut shows in their cart.", 
            "workexamples":[
                {
                    "title":"Hero Banners", 
                    "description":"Originally, the banner was just a static image without alt text or overlaid text that a screen reader could read. My goal was to build a responsive, changeable banner that showcased a hierarchy and had the ability to add multiple sub banners. I was able to create additional columns in the database to insert more data, then created CSS code to set different styles based on how many rows returned with my query as well as add alt text for the images.", 
                    "projecturl":"https://checksforfree.com/"
                }, 
                {
                    "title":"Rebranding", 
                    "description":"As a newly launched site, I looked closely at SEO and the user behavior. I noticed that the original site was missing a brand guideline and consistent typeface, color scheme and image sizes. Using Adobe XD, I created Digital Brand Guidelines for both ChecksforFree and CheckWorks sites then using CSS, I implemented the approved changes.", 
                    "projecturl":"https://checksforfree.com/"
                }
            ]
        },
        { 
            "title":"checkworks.com",
            "url":"https://checkworks.com/", 
            "imagepath":"CheckWorks.jpg",
            "company":"Main Street Inc.",
            "role":"Frontend Developer and UX Designer", 
            "framework":"Custom Build", 
            "technologies":[
                "React", 
                "Node.js", 
                "JSX", 
                "JavaScript", 
                "TypeScript",
                "CSS", 
                "C#",  
                ".NET", 
                "Docker", 
                "Visual Studio", 
                "MySQL", 
                "MySQL Server", 
                "FullStory", 
                "Google Analytics", 
                "Jira"
            ], 
            "description":"As apart of the Ecommerce team, I designed and built responsive, full stack code to optimize the user experience. Two projects that I accomplished was to add the bullet points to the product descriptions and to optimize all product images for faster loading time.", 
            "workexamples":[
                {
                    "title":"Header Hierarchy", 
                    "description":"While monitoring SEO, I noticed that the main category pages were missing meta titles and descriptions as well as proper h1s. I again added columns in the database to house this data and updated the queries to pull in the new data and display within a React NPM package called Helmet.", 
                    "projecturl":"https://checkworks.com/category/personal-checks"
                }, 
                {
                    "title":"Image Optimization", 
                    "description":"While monitoring user behavior using FullStory, I noticed that most of our users were really struggling with page loads. I looked closer and realized that the website was not pulling in thumbnail images but rather the large images on all of the category pages. I collaborated with marketing to get all of the images resized, then uploaded them to AWS and loaded them on the category pages. So now thumbnail images are being utilized on the category pages and the full sized images are rendering on the product detail page as well as alt text. It significantly improved the site's loading speeds and ADA compliancy.", 
                    "projecturl":"https://checkworks.com/category/personal-checks"
                }, 
                {
                    "title":"Product Bullet Points", 
                    "description":"As a new member of the team, I wasn't as familiar with the products and was curious about them. I noticed that the website itself did not have much information on the products so I thought I would add them. This was my first full stack project on the website. I built out MySQL tables, C# classes, queries and then created a React component nested within the Product Detail component that displayed the product details. I also wrote every bullet point and worked with their Product Manager to make sure every bullet was accurate.", 
                    "projecturl":"https://checkworks.com/category/personal-checks"
                }
            ]
        }, 
        { 
            "title":"summerclassics.com",
            "url":"https://summerclassics.com/", 
            "imagepath":"SummerClassics.jpg",
            "company":"Gabriella White",
            "role":"UX Designer and Developer", 
            "framework":"Magento", 
            "technologies":[
                "Magento", 
                "HTML", 
                "CSS", 
                "JavaScript",
                "Cognito Forms", 
                "Trello", 
                "SEO", 
                "Termly", 
                "uRapidFlow", 
                "Google Analytics"
            ], 
            "description":"I was a part of a small internal team that project managed, designed, developed and launched this Magento E-Commerce site. Post launch, I continued to manage, design and develop new user interfaces within the magento framework.", 
            "workexamples":[
                {
                    "title":"Product Data Clean Up", 
                    "description":"Largest contribution I made was I took on an extensive task of cleaning up the product data. I remapped all product attributes to attributes coming from the SQL tables that was provided from our Software Developer. I used uRapidFlow to create different import templates to make sure all attributes were mapping correctly then set up cron jobs to have them import automatically.", 
                    "projecturl":"https://summerclassics.com/pillows-and-rugs"
                }, 
                {
                    "title":"Sales & Promotions", 
                    "description":"I was in charge of scheduling out all of the sales and promotions hosted on the site. I sometimes created the digital assests if not provided by the marketing team then would schedule out all of the blocks and products for a seamless experience. After the sales, I worked within Google Analytics to track how our digital compaigns did and user behavior. I created a template and would share the data with the marketing team for future reference.", 
                    "projecturl":""
                }, 
                {
                    "title":"New Policies", 
                    "description":"For this project, I partnered with the head of Customer Service and together we generated new bussiness policies for our E-Commerce sites. Then using the Termly embeds, I added these policies to the website.", 
                    "projecturl":"https://summerclassics.com/terms-conditions"
                }
            ]
        },
        {
            "title":"gabby.com", 
            "url":"https://gabby.com/",
            "company":"Gabriella White",
            "imagepath":"Gabby.jpg",
            "role":"Project Manager, UX Designer, Power User and Business Analyst", 
            "framework":"Magento",
            "technologies":[
                "Magento", 
                "HTML", 
                "CSS", 
                "JavaScript",
                "Cognito Forms", 
                "Zapier", 
                "Trello", 
                "SEO", 
                "Termly", 
                "uRapidFlow", 
                "Google Analytics"
            ], 
            "description":"This site is the sister brand to Summer Classics. This site was launched accompanying the launch of summerclassics.com. Post launch, I continue to design, develop, and manage this Magneto Commerce site.", 
            "workexamples":[
                {
                    "title":"Form Build Out", 
                    "description":"When I first joined the team, they were using 3 different form builders and the responses were varied. I took on the task of using Cognito Forms to rebuild all of the forms on 1 platform. The biggest contribution was the contact us form. It contains over 50 different end points all determined by the user's choices throughout the process.", 
                    "projecturl":"https://summerclassics.com/contact-us"
                }, 
                {
                    "title":"Pillow Cleanup", 
                    "description":"The pillows were structured in the MySQL tables as group by color and family. Magento would take that data and only show 1 parent pillow. I opted for us to break apart the pillow data by color and then set the color attribute as a filter, therefore allowing a user to filter by color. Now, if a pillow comes in 2 different colors, both colors are shown on the frontend of the website.", 
                    "projecturl":"https://gabby.com/pillows-rugs/pillows"
                }
            ]
        },
        { 
            "title":"fabrics.gabby.com", 
            "url":"https://fabrics.gabby.com/",
            "imagepath":"GabbyFabrics.jpeg",
            "company":"Gabriella White",
            "role":"UX Designer", 
            "framework":"Wordpress",
            "technologies":[
                "WooCommerce",
                "Data Imports"
            ], 
            "description":"This site handles free fabric samples orders. I worked with an outside agency to develop and design this Wordpress WooComerce site. This site launched a week prior to the launch of the E-commerce sites. Post launch, I was managing the product data.", 
            "workexamples":[
                {
                    "title":"Post Launch Data Management", 
                    "description":"This site is a simple wordpress site that uses the WooCommerce plug in to handle the ordering of free fabric samples for the sales representatives. I was in charge of updating the product database based on product statuses within the system.", 
                    "projecturl":"https://fabrics.gabby.com/product-category/fabrics/"
                }
            ]
        }, 
        { 
            "title":"fabrics.summerclassics.com", 
            "url":"https://fabrics.summerclassics.com/",
            "imagepath":"SCFabrics.jpg",
            "company":"Gabriella White",
            "role":"UX Designer", 
            "framework":"Wordpress",
            "technologies":[
                "WooCommerce",
                "Data Imports"
            ],  
            "description":"This site handles free fabric samples orders for summer classics outdoor performance fabrics. I worked with an outside agency to develop and design this Wordpress WooComerce site. This site launched a week prior to the launch of the E-commerce sites. Post launch, I am managing the product data.", 
            "workexamples":[
                {
                    "title":"Post Launch Data Management", 
                    "description":"This site is a simple wordpress site that uses the WooCommerce plug in to handle the ordering of free fabric samples for the sales representatives. I was in charge of updating the product database based on product statuses within the system.", 
                    "projecturl":"https://fabrics.summerclassics.com/product-category/fabrics/"
                }
            ]
        },
        {
            "title":"contract.summerclassics.com", 
            "url":"https://contract.summerclassics.com/",
            "imagepath":"SCContract.jpg",
            "company":"Gabriella White",
            "role":"UX Designer", 
            "framework":"Magento",
            "technologies":[
                "Adobe XD"
            ], 
            "description":"I handle the daily oppations for this site. I worked with a software developer to generate product feeds from the ERP system. This site is now entirely feed and populated by those feeds.", 
            "workexamples":[
                {
                    "title":"MegaMenu Installation", 
                    "description":"Before, this site used the default Magento dropdown menu. With all of the options, it was too lengthy and was not responsive. With the help of a developer who installed the Megamenu Magento block, I was able to build out the new megamenu structure. It greatly improved the user experience.", 
                    "projecturl":"https://contract.summerclassics.com/"
                }, 
                {
                    "title":"Case Study Pages", 
                    "description":"I designed and built this page and all individual case study pages using graphics provided from the marketing team.", 
                    "projecturl":"https://contract.summerclassics.com/case-studies"
                }, 
                {
                    "title":"Assembly Instructions", 
                    "description":"With the help of a developer who installed a pdf plugin to the Magento site, I was able to upload all of the assembly instructions. Given the large amount of different products, I designed this page to use accordians and organized by product category for ease of use.", 
                    "projecturl":"https://contract.summerclassics.com/assembly-instructions"
                }
            ]
        },
        {
            "title":"trade.summerclassics.com", 
            "url":"https://trade.summerclassics.com/",
            "imagepath":"SCTrade.jpeg",
            "company":"Gabriella White", 
            "role":"UX Designer", 
            "framework":"Magento", 
            "technologies":[
                "PhotoShop", 
                "Adobe XD", 
                "Flippingbook", 
                "Termly"
            ], 
            "description":"I was apart of a small team that designed, built and launched this site. I contributed all of the landing pages and content for this build.", 
            "workexamples":[
                {
                    "title":"Home Page Layout", 
                    "description":"I created wireframes and presented to the Wholesale, Customer Service and Leadership team. Once my design was approved, I built out the page in the Magento page builder.", 
                    "projecturl":"https://trade.summerclassics.com/"
                }, 
                {
                    "title":"New Catalog UX", 
                    "description":"One project I spearheaded was a new catalog viewing tool. I decided to go with Flippingbook and worked with the marketing team to archieve all of their past catalogs into Flippingbook. Once there, I then used the embed codes to display them on the trade site.", 
                    "projecturl":"https://trade.summerclassics.com/catalogs"
                }
            ]
        }, 
        {
            "title":"trade.gabby.com", 
            "url":"https://trade.gabby.com/",
            "imagepath":"GabbyTrade.jpeg",
            "company":"Gabriella White", 
            "role":"UX Designer", 
            "framework":"Magento", 
            "technologies":[
                "Cognito Forms", 
                "Termly", 
                "Flippingbook"
            ], 
            "description":"This is the sister site to the SummerClassics Trade site. I preformed the same roles on both sites.", 
            "workexamples":[
                {
                    "title":"COM Form", 
                    "description":"I partnered with Customer Service and Facilities departments to create a new COM (Customer's Own Material) Form. The old form was wordy and confusing. By breaking up the form into different pages, it simplified the user experience. This form got a huge amount of praise once I launched it.", 
                    "projecturl":"https://trade.gabby.com/customers-own-material-com"
                }
            ]
        }, 
        {
            "title": "summerclassics.com/blog", 
            "url":"https://summerclassics.com/blog/",
            "imagepath":"SCBlog.jpg",
            "company":"Gabriella White",
            "role":"UX Designer", 
            "framework":"Wordpress",
            "technologies":"", 
            "description":"I was head of a small team to build this content site. I worked very closely with an outside agency to design and develop this site. This site was launch in tandom with the new Commerce sites. Post launch, I manage this site and handle all content updates.", 
            "workexamples":""
        },
        {
            "title": "gabby.com/blog/", 
            "url":"https://gabby.com/blog",
            "imagepath":"GabbyBlog.jpg", 
            "company":"Gabriella White",
            "role":"UX Designer", 
            "framework":"Wordpress",
            "technologies":"", 
            "description":"This is the sister site to blog.summerclassics.com. Post launch, I now manage this site and handle all content updates.", 
            "workexamples":""
        }, 
        {
            "title": "My Portfolio Site", 
            "url":"https://my-portfolio-kappa-vert.vercel.app/",
            "imagepath":"Portfolio.jpeg",
            "company":"N/A",
            "role":"Developer & Designer", 
            "framework":"React",
            "technologies":[
                "React.js", 
                "Node.js", 
                "JSON", 
                "JavaScript", 
                "CSS", 
                "JSX", 
                "Adobe XD", 
                "Photoshop", 
                "Vercel", 
                "MySQL", 
                "MVC"
            ], 
            "description":"Welcome to my portfolio site. I built this site myself and am so glad you are looking at it.", 
            "workexamples":
            [
                {
                    "title":"MySQL Database", 
                    "description":"I used the MVC structure to create a MySQL database to house all of my project data in a table.", 
                    "projecturl":"https://my-portfolio-kappa-vert.vercel.app/projects"
                }, 
                {
                    "title":"Custom Background", 
                    "description":"I decided to design my own background for this site. The background image is a piece made by me using Photoshop.", 
                    "projecturl":"https://my-portfolio-kappa-vert.vercel.app/"
                } 
            ]
        }

    ]
}